package main

import (
	"fmt"
)

func showmenu() {
	menu := map[string]map[string]int{
		"Кофе": {
			"Эспрессо":         120,
			"Двойной эспрессо": 150,
			"Американо":        170,
			"Капучино":         200,
			"Латте":            200,
			"Раф":              250,
			"Айс Латте":        200,
			"Айс Капучино":     200,
		},

		"Фреш": {
			"Апельсиновый": 300,
			"Ананасовый":   500,
			"Гранатовый":   350,
			"Яблочный":     300,
			"Микс":         350,
		},

		"Чай": {
			"Ассам":         350,
			"Пуэр":          350,
			"Граф Орлов":    350,
			"Дикая Вишня":   350,
			"Мате":          350,
			"Молочный Улун": 350,
		},

		"Завтраки": {
			"Английский":  400,
			"Французский": 450,
			"Турецкий":    950,
			"С Курицей":   350,
			"Шакшука":     350,
		},

		"Десерты": {
			"Венские вафли":     300,
			"Шоколадный Фандан": 300,
			"Панкейки":          280,
			"Круассан":          300,
		},
	}
	fmt.Println("Меню кофейни GreenRoom")
	for category, items := range menu {
		fmt.Printf("\n%s: \n", category)
		for item, price := range items {
			fmt.Printf("  %s - %d\n", item, price)
		}
	}
}

func main() {
	showmenu()

}
